[
    {
        "id": 1,
        "text": "I create detailed daily study schedules for major exams and stick to them rigidly."
    },
    {
        "id": 2,
        "text": "I feel accomplished when I methodically organize all my notes and study materials."
    },
    {
        "id": 3,
        "text": "I complete all assigned readings and tasks before considering a topic \"done.\""
    },
    {
        "id": 4,
        "text": "I maintain disciplined study routines even when I don't feel motivated."
    },
    {
        "id": 5,
        "text": "When behind schedule, I immediately work extra hours to catch up."
    },
    {
        "id": 6,
        "text": "My family's high expectations for my medical career create pressure and anxiety."
    },
    {
        "id": 7,
        "text": "Difficult topics make me feel overwhelmed and doubt my medical abilities."
    },
    {
        "id": 8,
        "text": "I worry about exam performance even when I've prepared well."
    },
    {
        "id": 9,
        "text": "During difficult tests, my mind goes blank or races with anxious thoughts."
    },
    {
        "id": 10,
        "text": "I second-guess exam answers, often changing correct ones due to lost confidence."
    },
    {
        "id": 11,
        "text": "I read extra medical content simply because I find it fascinating."
    },
    {
        "id": 12,
        "text": "I learn best by understanding deep principles rather than just memorizing facts."
    },
    {
        "id": 13,
        "text": "Rote memorization of facts like anatomy tables feels tedious and unfulfilling."
    },
    {
        "id": 14,
        "text": "I enjoy connecting concepts between different medical subjects like biochemistry and clinics."
    },
    {
        "id": 15,
        "text": "Complex challenges motivate me more than perfect scores on easy tests."
    },
    {
        "id": 16,
        "text": "Discussing difficult concepts with classmates energizes me after long lecture days."
    },
    {
        "id": 17,
        "text": "Studying alone for long periods feels draining and demotivating to me."
    },
    {
        "id": 18,
        "text": "I learn concepts best when explaining them out loud to others."
    },
    {
        "id": 19,
        "text": "I quickly organize or join study groups when preparing for exams."
    },
    {
        "id": 20,
        "text": "I actively seek feedback and discussion to clarify my understanding."
    },
    {
        "id": 21,
        "text": "I pause my revision to help struggling classmates, even risking schedule delays."
    },
    {
        "id": 22,
        "text": "I find it easy to ask classmates or seniors for help."
    },
    {
        "id": 23,
        "text": "I prefer cooperative learning environments over highly competitive ones."
    },
    {
        "id": 24,
        "text": "In group discussions, I ensure everyone understands and reaches consensus."
    },
    {
        "id": 25,
        "text": "Patient empathy during clinical rotations strongly motivates my learning."
    }
]